## CRIAR COLUNA(S)

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

CRIAR COLUNAS UTILIZANDO ATRIBUIÇÃO DIRETA

In [3]:
# utilizando atribuição direta
df["nutricionista"] = "Carolina" 
df

     NOME  ALTURA  PESO  IDADE nutricionista
0   MARIA    1.77    65     40      Carolina
1  Sandra    1.65    72     20      Carolina

com atribuição direta podemos criar diversas colunas de uma vez e podemos usar métodos, funções e operadores para criar colunas com dados a partir de dados de outras colunas

In [4]:
df["nutricionista"], df['imc'] = "Joana", df['PESO']/df['ALTURA']**2
df

     NOME  ALTURA  PESO  IDADE nutricionista        imc
0   MARIA    1.77    65     40         Joana  20.747550
1  Sandra    1.65    72     20         Joana  26.446281

com atribuição direta, as colunas são sempre criadas no final do dataframe.

ATENÇÃO! Quando criamos uma coluna com mesmo nome de coluna já existente, ele substitui os valores da coluna antiga pelos valores novos, não cria coluna em duplicidade.

CRIAR COLUNA UTILIZANDO O MÉTODO .insert()

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.insert.html

In [5]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

In [6]:
# com insert podemos encadear métodos e não precisa do inplace ou reatribuição da variável para modificar o df
df.insert(0, column = 'nutricionista', value = "Carolina")

In [7]:
df

  nutricionista    NOME  ALTURA  PESO  IDADE
0      Carolina   MARIA    1.77    65     40
1      Carolina  Sandra    1.65    72     20

In [8]:
df.insert(0, column = 'nutricionista', value = "Carolina")

ValueError: cannot insert nutricionista, already exists

o método .insert() por padrão não permite criar coluna que já existe no dataframe. podemos utilizar o parâmetro allow_duplicates = True, e então ele permitirá criar colunas em duplicidade.

In [9]:
# aceita lista e série com valores 
df.insert(loc = 0, column = 'nutricionista', value = ["Joana","Carolina"], allow_duplicates=True)

ATENÇÃO: ao usar o parâmetro allow_duplicates=True o insert criará nova coluna com o mesmo nome, não substituirá os valores da coluna já existente

In [10]:
df

  nutricionista nutricionista    NOME  ALTURA  PESO  IDADE
0         Joana      Carolina   MARIA    1.77    65     40
1      Carolina      Carolina  Sandra    1.65    72     20

o método .insert() não permite criar mais de uma coluna de uma vez, mas permite escolher a localização da coluna no dataframe.
Também não permite criar colunas a partir de funções, métodos e operadores

CRIAR COLUNA(S) UTILIZANDO O MÉTODO .assign()

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.assign.html

In [11]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

o método assign permite criar mais de uma coluna ao mesmo tempo e usar funções, métodos e operadores

In [12]:
df.assign(nutricionista = ["Carolina", "Joana"], imc = df['PESO']/df["ALTURA"]**2, NOME = df['NOME'].str.title())

     NOME  ALTURA  PESO  IDADE nutricionista        imc
0   Maria    1.77    65     40      Carolina  20.747550
1  Sandra    1.65    72     20         Joana  26.446281

podemos perceber que o método assign aceita colunas já existentes, porém, ao contrário do insert que cria coluna com nome duplicado, o assign modifica o valor da coluna já existente

In [13]:
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

In [14]:
df = df.assign(nutricionista = ["Carolina", "Joana"], imc = df['PESO']/df["ALTURA"]**2, NOME = df['NOME'].str.title())

In [15]:
df

     NOME  ALTURA  PESO  IDADE nutricionista        imc
0   Maria    1.77    65     40      Carolina  20.747550
1  Sandra    1.65    72     20         Joana  26.446281